Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: If you don't want to create a deserializer for each data object, you can use the generic `io.vertx.kafka.client.serialization.JsonObjectDeserializer` that will deserialize to a `io.vertx.core.json.JsonObject`. The corresponding serializer can also be used: `io.vertx.kafka.client.serialization.JsonObjectSerializer`.
ja_jp: 各データオブジェクトにデシリアライザーを作成したくない場合は、 `io.vertx.core.json.JsonObject` にデシリアライズする汎用の `io.vertx.kafka.client.serialization.JsonObjectDeserializer` を使用することができます。対応するシリアライザーの `io.vertx.kafka.client.serialization.JsonObjectSerializer` も使用できます。

source: If you don't want to follow all these steps, you can go right to the completed example.
ja_jp: これらの手順を順にすべて実行しない場合、完成したサンプルを以下で確認できます。

source: If you don't want to generate a Job resource, you can specify the resource you want to generate using the property `quarkus.kubernetes.deployment-kind`. For example, if you want to generate a Deployment resource, use `quarkus.kubernetes.deployment-kind=Deployment`.
ja_jp: Jobリソースを生成しない場合は、プロパティ `quarkus.kubernetes.deployment-kind` を使用して生成したいリソースを指定します。たとえば、Deployment リソースを生成したい場合は、 `quarkus.kubernetes.deployment-kind=Deployment` を使用します。

source: If you don't want to generate a new project, add the dependency in your build file:
ja_jp: 新しいプロジェクトを生成したくない場合は、ビルドファイルに依存関係を追加してください。

source: If you don't want to specify a port you can set `quarkus.http.port=0` and `quarkus.http.test-port=0` when using Vert.x (`quarkus.grpc.server.use-separate-server=false)` or `quarkus.grpc.server.port=0` and `quarkus.grpc.server.test-port=0` when using the gRPC server. A random open port will be picked by the OS, and a log message printed in the console.
ja_jp: ポートを指定したくない場合、Vert.x を使用している場合 (`quarkus.grpc.server.use-separate-server=false`) は `quarkus.http.port=0` と `quarkus.http.test-port=0` を、gRPC サーバーを使用している場合は `quarkus.grpc.server.port=0` と `quarkus.grpc.server.test-port=0` を設定できます。OS によってランダムな空きポートが選択され、コンソールにログメッセージが出力されます。

source: If you don't want to specify a port you can set `quarkus.http.port=0` or `quarkus.http.test-port=0`. A random open port will be picked by the OS, and a log message printed in the console.
ja_jp: ポートを指定したくない場合は、 `quarkus.http.port=0` または `quarkus.http.test-port=0` を設定できます。OS によってランダムな空きポートが選択され、コンソールにログメッセージが表示されます。

source: If you don't want to specify a port you can set `quarkus.http.port=0` or `quarkus.http.test-port=0`. A random open port will be picked by the OS, and a log message printed in the console. When the port is bound the `quarkus.http.port` system property will be set to the actual port that was selected, so you can use this to get the actual port number from inside the application. If you are in a test you can inject the URL normally and this will be configured with the actual port, and REST Assured will also be configured appropriately.
ja_jp: ポートを指定したくない場合は、 `quarkus.http.port=0` または `quarkus.http.test-port=0` を指定することができます。ランダムに開いているポートが OS によって選ばれ、コンソールにログメッセージが表示されます。ポートがバインドされると、 `quarkus.http.port` システムプロパティーには選択された実際のポートが設定されます。そのため、これを利用して、アプリケーション内から実際のポート番号を取得できます。テスト中の場合は普通に URL を注入することができ、これは実際のポートで設定され、REST Assured も適切に設定されます。

source: If you don't want to specify the opening of the `java.lang` module in your pom.xml file, you can also specify it as an argument when you start the dev mode.
ja_jp: pom.xml ファイルに `java.lang` モジュールのオープンを指定したくない場合は、devモードの起動時に引数として指定することもできます。

source: If you don't want to use a real OAuth2 authorization server for your integration tests, you can use the xref:security-properties.adoc[Properties based security] extension for your test, or mock an authorization server using Wiremock.
ja_jp: 統合テストに本物の OAuth2 認可サーバーを使いたくない場合は、テストに xref:security-properties.adoc[プロパティベースのセキュリティ] エクステンションを使うか、Wiremock を使って認可サーバーをモックすることができます。

source: If you don't want to use the Maven plugin, you can just include the dependency in your build file:
ja_jp: Mavenプラグインを使用したくない場合は、ビルドファイルに依存関係を含めるだけでよいです:

source: If you don’t configure a deserialization failure handler and a deserialization failure happens, the application is marked unhealthy. You can also ignore the failure, which will log the exception and produce a `null` value. To enable this behavior, set the `mp.messaging.incoming.$channel.fail-on-deserialization-failure` attribute to `false`.
ja_jp: デシリアライゼーションエラーハンドラーを設定していない場合に、デシリアライゼーションエラーが発生した場合、アプリケーションは unhealthy とマークされます。 エラーを無視することもできます。その場合、例外がログに記録され、 `null` 値が生成されます。 この動作を有効にするには、 `mp.messaging.incoming.$channel.fail-on-deserialization-failure` 属性を `false` に設定します。

source: If you don’t want to generate a new project, add the following dependencies to your build file.
ja_jp: 新しいプロジェクトを生成したくない場合は、以下の依存関係をビルドファイルに追加してください。

source: If you enable an <<authorization-code-flow>> authentication with `quarkus.oidc.application-type=web-app`, then configuring `quarkus.oidc.client-id` and `quarkus.oidc.credentials.secret` (or other type of client credentials) is required in order to complete the current authorization code flow, because the OIDC token endpoint requires the client authentication.
ja_jp: `quarkus.oidc.application-type=web-app` で <<authorization-code-flow>> 認証を有効にする場合、 OIDC トークンエンドポイントでクライアント認証が必要なため、現在の認可コードフローを完了するには `quarkus.oidc.client-id` と `quarkus.oidc.credentials.secret` (または他のタイプのクライアントクレデンシャル) の設定が必要です。

source: If you enable the `staging` profile, the HTTP port is set to `8082` instead of `8081`.
ja_jp: `staging` プロファイルを有効にすると、HTTP ポートは `8081` ではなく `8082` に設定されます。

source: If you enable the `staging` profile, the HTTP port will be 8082, whereas it would be 8081 otherwise.
ja_jp: `staging` プロファイルを有効にした場合、HTTP ポートは 8082 になりますが、そうでない場合は 8081 になります。

source: If you enable the management interface without customizing the management network interface and port, the health checks are exposed under: `http://0.0.0.0:9000/q/health`. You can configure the _path_ (the `health` segment in the previous URL) using the `quarkus.smallrye-health.root-path` property.
ja_jp: マネジメントネットワークインターフェースとポートをカスタマイズせずにマネジメントインターフェースを有効にした場合、ヘルスチェックは以下のように公開されます： `http://0.0.0.0:9000/q/health` . `quarkus.smallrye-health.root-path` プロパティを使用して、 _path_ （前の URL の `health` セグメント）を設定することができます。

source: If you enabled the `quarkus.flyway.migrate-at-start` property, by the time you use the Flyway instance, Quarkus will already have run the migrate operation
ja_jp: `quarkus.flyway.migrate-at-start` プロパティーを有効にした場合、Flyway インスタンスを使用する時点で、Quarkus はすでにマイグレーション操作を実行しています。

source: If you enabled the `quarkus.liquibase.migrate-at-start` property, by the time you use the Liquibase instance, Quarkus will already have run the migrate operation.
ja_jp: `quarkus.liquibase.migrate-at-start` プロパティーを有効にした場合、Liquibase インスタンスを使用する時点で、Quarkus はすでにマイグレーション操作を実行しています。

source: If you encounter any issue upgrading to this new version, please report it so that we can either fix it or add the information to the guide.
ja_jp: この新しいバージョンにアップグレードする際に問題が発生した場合は、報告していただければ、修正するか、ガイドに情報を追加します。

source: If you encounter the following error when running your application in native mode: + `Failed to encode 'MyObject'. Encoding 'myVariable' errored with: Can't find a codec for class org.acme.MyVariable.` + This means that the `org.acme.MyVariable` class is not known to GraalVM, the remedy is to add the `@RegisterForReflection` annotation to your `MyVariable class`. More details about the `@RegisterForReflection` annotation can be found on the xref:writing-native-applications-tips.adoc#registerForReflection[native application tips] page.
ja_jp: アプリケーションをネイティブモードで実行した際に、以下のようなエラーが発生した場合があります。+ `Failed to encode 'MyObject'. Encoding 'myVariable' errored with: Can’t find a codec for class org.acme.MyVariable.` + これは、 `org.acme.MyVariable` クラスがGraalVMに知られていないことを意味しています。対策としては、 `@RegisterForReflection` アノテーションを `MyVariable class` に追加してください。 `@RegisterForReflection` アノテーションの詳細については、 link:writing-native-applications-tips.html#registerForReflection[ネイティブアプリケーションのヒント]のページをご覧ください。

source: If you encounter the following error when running your application in native mode: + `Failed to encode 'MyObject'. Encoding 'myVariable' errored with: Can't find a codec for class org.acme.MyVariable.` + This means that the `org.acme.MyVariable` class is not known to GraalVM, the remedy is to add the `@RegisterForReflection` annotation to your `MyVariable` class. More details about the `@RegisterForReflection` annotation can be found on the xref:writing-native-applications-tips.adoc#registerForReflection[native application tips] page.
ja_jp: アプリケーションをネイティブモードで実行しているときに次のエラーが発生する場合があります。+ `Failed to encode 'MyObject'. Encoding 'myVariable' errored with: Can't find a codec for class org.acme.MyVariable.` + これは、 `org.acme.MyVariable` クラスが GraalVM に認識されていないことを示しています。解決策は、 `MyVariable` クラスに `@RegisterForReflection` アノテーションを追加することです。 `@RegisterForReflection` アノテーションの詳細は、xref:writing-native-applications-tips.adoc#registerForReflection[ネイティブアプリケーションのヒント] ページを参照してください。

source: If you ever want to build a native container image and already have an existing native image you can set `-Dquarkus.native.reuse-existing=true` and the native image build will not be re-run.
ja_jp: ネイティブコンテナイメージをビルドしたいときに、すでに既存のネイティブイメージがある場合は、 `-Dquarkus.native.reuse-existing=true` を設定すれば、ネイティブイメージのビルドは再実行されません。

source: If you exchange user's credentials for the access token, here is an example configuration for the `password` grant type:
ja_jp: ユーザーの認証情報をアクセストークンと交換する場合、 `password` のグラントタイプの設定例を以下に示します:

source: If you expect the custom resolvers always to resolve a tenant, you do not need to configure the default tenant resolution.
ja_jp: カスタムリゾルバーが常にテナントを解決することを期待する場合は、デフォルトのテナント解決を設定する必要はありません。

source: If you experience frequent disconnections from the broker, the `AmqpClientOptions` can also be used to set a heartbeat if you need to keep the AMQP connection permanently. Some brokers might terminate the AMQP connection after a certain idle timeout. You can provide a heartbeat value which will be used by the Vert.x proton client to advertise the idle timeout when opening transport to a remote peer.
ja_jp: ブローカとの接続が頻繁に切断される場合、AMQP 接続を永続的に維持する必要があれば、 `AmqpClientOptions` を使用してハートビートを設定することもできます。 ブローカによっては、一定のアイドルタイムアウト後に AMQP 接続を終了する場合があります。ハートビート値を指定すると、Vert.x proton クライアントがリモートピアへのトランスポートを開始する際にアイドルタイムアウトを通知するために使用されます。

source: If you feel like contributing to these registries or creating new ones, the https://github.com/quarkiverse/quarkus-micrometer-registry[Quarkus Micrometer Registry project] is the place you are looking for.
ja_jp: これらのレジストリーに貢献したい、または新しいレジストリーを作成したいとお考えの方は、 link:https://github.com/quarkiverse/quarkus-micrometer-registry[Quarkus Micrometer Registryプロジェクト] をご利用ください。

source: If you find your icon at https://fontawesome.com/search?o=r&m=free[Font awesome], you can map as follow: Example `<i class="fa-solid fa-house"></i>` will map to `font-awesome-solid:house`, so `fa` becomes `font-awesome` and for the icon name, remove the `fa-`.
ja_jp: https://fontawesome.com/search?o=r&m=free[Font awesome] でアイコンを見つけた場合は、次のようにマッピングできます。たとえば、 `<i class="fa-solid fa-house"></i>` は `font-awesome-solid:house` にマッピングされるため、 `fa` は `font-awesome` になり、アイコン名から `fa-` が削除されます。

source: If you followed the instructions, you should have the Artemis server running. Then, you just need to run the application using:
ja_jp: 手順に従うことで、Artemis サーバーを起動できます。あとは、アプリケーションを使用して実行するだけです。

source: If you followed the instructions, you should have the Redis server running. Then, you just need to run the application using:
ja_jp: 指示に従えば、Redisサーバーが起動しているはずです。あとは、アプリケーションを使って実行するだけです。

source: If you followed the xref:kafka.adoc[Kafka guide], the interceptors can be added on the `generated-price` and the `prices` channels as follows:
ja_jp: link:kafka[Kafkaのガイド] に従った場合、以下のように `generated-price` と `prices` のチャンネルにインターセプターを追加することができます:

source: If you generate an OpenAPI schema document with the SmallRye OpenAPI extension, the Basic authentication must be enabled during the build-time with the `quarkus.http.auth.basic` configuration property.
ja_jp: SmallRye OpenAPI エクステンションで OpenAPI スキーマードキュメントを生成する場合、ビルド時に `quarkus.http.auth.basic` 設定プロパティーで Basic 認証を有効にする必要があります。

source: If you get an error about `app` not being readable then you probably have a JBang version older than v0.56.0 installed. Please remove or upgrade it to a recent version.
ja_jp: `app` が読み取れないというエラーが発生した場合は、v0.56.0 より古いバージョンの JBang がインストールされている可能性があります。削除するか、最新バージョンにアップグレードしてください。

source: If you handle user and credential creation and logins yourself in your endpoints, you only need to provide a read-only view of your entities in your link:{webauthn-api}/io/quarkus/security/webauthn/WebAuthnUserProvider.html[`WebAuthnUserProvider`], so you can skip the `store` and `update` methods:
ja_jp: ユーザーおよび認証情報の作成やログインを自身でエンドポイントで処理する場合、 link:{webauthn-api}/io/quarkus/security/webauthn/WebAuthnUserProvider.html[`WebAuthnUserProvider`] にエンティティーの読み取り専用ビューを提供することのみが必要です。そのため、 `store` および `update`メソッド は省略できます。

source: If you happen to be running on Linux, you can execute the `ps` command directly, since your shell is the same as the container host:
ja_jp: Linuxを使用している場合は、シェルがコンテナホストと同じであるため、 `ps` コマンドを直接実行することができます:

source: If you have Bearer tokens in a JWT format then all these 3 extensions can be used. Both `quarkus-oidc` and `quarkus-smallrye-jwt` support refreshing the JsonWebKey (JWK) set when the OpenID Connect provider rotates the keys, therefore `quarkus-oidc` or `quarkus-smallrye-jwt` should be used for verifying JWT tokens if the remote token introspection has to be avoided or not supported by the providers.
ja_jp: JWT 形式の Bearer トークンを持っている場合は、これら 3 つのエクステンションをすべて使用することができます。 `quarkus-oidc` と `quarkus-smallrye-jwt` の両方は、OpenID Connect プロバイダーがキーをローテーションする際の JsonWebKey (JWK) セットのリフレッシュをサポートします。したがって、リモートトークンのイントロスペクションを回避しなければならない場合や、プロバイダーがサポートしていない場合は、JWT トークンの検証に `quarkus-oidc` または `quarkus-smallrye-jwt` を使用する必要があります。

source: If you have Gradle Kotlin build files (`.kts`), Quarkus Update https://github.com/quarkusio/quarkus/issues/33046[will fail] until OpenRewrite supports these.
ja_jp: Gradle Kotlinビルドファイル( `.kts` )がある場合、OpenRewriteがこれらをサポートするまで、Quarkus Updateは link:https://github.com/quarkusio/quarkus/issues/33046[失敗します] 。

source: If you have JBang already installed, run:
ja_jp: JBangが既にインストールされている場合は、次を実行してください：

source: If you have a `NamedQuery` then you can enable caching directly on its definition, which will usually be on an entity:
ja_jp: `NamedQuery` があれば、その定義で直接キャッシュを有効にすることができます。これは通常、エンティティ上で行われます:

source: If you have a `persistence.xml`, then you cannot use the `quarkus.hibernate-orm.*` properties and only persistence units defined in `persistence.xml` will be taken into account.
ja_jp: `persistence.xml` がある場合には `quarkus.hibernate-orm.*` のプロパティは使用できず、 `persistence.xml` で定義された永続化ユニットのみが考慮されます。

source: If you have a good reason to disable the authorization (for example, when testing) then you can register a custom `AuthorizationController`:
ja_jp: 認可を無効にする正当な理由がある場合(テスト時など)は、カスタムの `AuthorizationController` を登録してください。

source: If you have a good reason to disable the authorization then you can register a custom `AuthorizationController`:
ja_jp: 認可を無効にする正当な理由がある場合(テスト時など)は、カスタムの `AuthorizationController` を登録してください。 :

source: If you have a look at your `deployment` module, you will see a `MessageTransformersAsBeansProcessor` and you can see a method annotated with the `@BuildStep` annotation in it.
ja_jp: `deployment` モジュールを見ると、 `MessageTransformersAsBeansProcessor` 、その中に `@BuildStep` のアノテーションが付いたメソッドがあるのがわかると思います。

source: If you have a question about Quarkus you would like answered let us know on one of thoses sites using `quarkusinsights` as a tag.
ja_jp: Quarkusについて質問がある場合は、 `quarkusinsights` をタグとして使用して、いずれかのサイトで教えていただきたいと思います。

source: If you have a question about Quarkus you would like answered let us know on one of thoses sites.
ja_jp: 答えてほしいQuarkusに関する質問がある場合は、以下のいずれかのサイトでお知らせください。

source: If you have a question, ping me @ia3andy on https://quarkusio.zulipchat.com/.
ja_jp: 質問がある場合は、 https://quarkusio.zulipchat.com/ で @ia3andy に ping してください。

source: If you have a single connector on your classpath, you can omit the `connector` attribute configuration. Quarkus automatically associates _orphan_ channels to the (unique) connector found on the classpath. _Orphan_ channels are outgoing channels without a downstream consumer or incoming channels without an upstream producer.
ja_jp: クラスパスに単一のコネクターがある場合は、 `connector` 属性の設定を省略できます。 Quarkus は、_孤立した_ チャネルをクラスパスにある (一意の) コネクターに自動的に関連付けます。 _孤立した_ チャネルとは、ダウンストリームコンシューマーのない発信チャネル、またはアップストリームプロデューサーのない着信チャネルです。

source: If you have a single connector on your classpath, you can omit the `connector` attribute configuration. Quarkus automatically associates _orphan_ channels to the (unique) connector found on the classpath. _Orphans_ channels are outgoing channels without a downstream consumer or incoming channels without an upstream producer.
ja_jp: クラスパスに単一のコネクターがある場合は、 `connector` 属性の設定を省略できます。Quarkus は、_orphan_ チャネルをクラスパスにある (一意の) コネクターに自動的に関連付けます。_Orphans_ チャネルは、ダウンストリームコンシューマーのない outgoing チャネル、またはアップストリームプロデューサーのない incoming チャネルです。

source: If you have a use case for that and clever ideas about how to implement it without cluttering the simplified Panache approach, contact us on the link:{quarkus-mailing-list-index}[quarkus-dev mailing list].
ja_jp: もし、そのようなユースケースがあり、シンプルな Panache のアプローチを乱すことなく実装する方法についてすばらしいアイデアがあれば、 link:{quarkus-mailing-list-index}[quarkus-dev メーリングリスト]までご連絡ください。

source: If you have a xref:security-oidc-bearer-token-authentication.adoc#single-page-applications[single page application for service applications] where your OIDC provider script such as `keycloak.js` is managing an authorization code flow, then that script will also control the SPA authentication session lifespan.
ja_jp: `keycloak.js` などの OIDC プロバイダースクリプトが認可コードフローを管理している xref:security-oidc-bearer-token-authentication.adoc#single-page-applications[サービスアプリケーション用のシングルページアプリケーション] がある場合、そのスクリプトは SPA 認証セッションの有効期間も制御します。

source: If you have a xref:security-oidc-bearer-token-authentication.adoc#single-page-applications[single page application for service applications] where your OIDC provider script, such as `keycloak.js`, is managing an authorization code flow, then that script will also control the SPA authentication session lifespan.
ja_jp: `keycloak.js` などの OIDC プロバイダースクリプトが認可コードフローを管理している xref:security-oidc-bearer-token-authentication.adoc#single-page-applications[サービスアプリケーション用のシングルページアプリケーション] がある場合、そのスクリプトは SPA 認証セッションの有効期間も制御します。

source: If you have a xref:security-openid-connect.adoc#single-page-applications[Single Page Application for Service Applications] where your OpenID Connect Provider script such as `keycloak.js` is managing an authoriization code flow then that script will also control the SPA authentication session lifespan.
ja_jp: xref:security-openid-connect.adoc#single-page-applications[サービスアプリケーション用のSingle Page Application] で、OpenID Connect Providerスクリプト（ `keycloak.js` ）が認可コードフローを管理している場合、そのスクリプトはSPAの認証セッションの寿命も制御することになります。

source: If you have a xref:security-openid-connect.adoc#single-page-applications[Single Page Application for Service Applications] where your OpenID Connect Provider script such as `keycloak.js` is managing an authorization code flow then that script will also control the SPA authentication session lifespan.
ja_jp: `keycloak.js` などの OpenID Connect Provider スクリプトが認可コードフローを管理している xref:security-openid-connect.adoc#single-page-applications[サービスアプリケーション用のシングルページアプリケーション] の場合、そのスクリプトは SPA 認証セッションの寿命も制御します。

source: If you have access to the source code responsible for the reference to the missing dependency and can alter it, you should consider one of the following:
ja_jp: 欠落している依存関係への参照を担当するソースコードにアクセスでき、それを変更できる場合は、次のいずれかを検討するべきです:

source: If you have an already created project, the `reactive-pg-client` extension can be added to an existing Quarkus project with the `add-extension` command:
ja_jp: すでに作成済みのプロジェクトがある場合は、 `add-extension` コマンドで既存のQuarkusプロジェクトに `reactive-pg-client` エクステンションを追加することが出来ます。

source: If you have an already created project, the `vertx` extension can be added to an existing Quarkus project with the `add-extension` command:
ja_jp: すでに作成済みのプロジェクトがある場合は、 `vertx` エクステンションを既存のQuarkusプロジェクトに `add-extension` コマンドで追加することができます。

source: If you have any questions, suggestions or feedback, by all means please https://github.com/redhat-developer/intellij-quarkus/issues[open an issue].
ja_jp: ご質問、ご意見、ご感想などがありましたら、ぜひ link:https://github.com/redhat-developer/intellij-quarkus/issues[イシューを開いて]ください。

source: If you have built Quarkus locally, you can use that version:
ja_jp: Quarkus をローカルでビルドしている場合は、そのバージョンを使用できます。

source: If you have defined one of the `PeopleResource` interfaces mentioned above, this extension will generate its implementation using a particular data access strategy. The implemented class then will be used by a generated JAX-RS resource, which will look like this:
ja_jp: 上記の `PeopleResource` インターフェイスのいずれかを定義している場合、このエクステンションは特定のデータアクセス戦略を使用してその実装を生成します。実装されたクラスは、生成された JAX-RS リソースによって使用され、以下のようになります。

source: If you have defined one of the `PeopleResource` interfaces mentioned above, this extension will generate its implementation using a particular data access strategy. The implemented class then will be used by a generated Jakarta REST resource, which will look like this:
ja_jp: 上記の `PeopleResource` インターフェイスのいずれかを定義している場合、このエクステンションは特定のデータアクセス戦略を使用してその実装を生成します。 実装されたクラスは生成された Jakarta REST リソースで使われます：

source: If you have existing Vert.x code, use `io.vertx.redis.client.RedisAPI`
ja_jp: 既存の Vert.x コードがある場合は、 `io.vertx.redis.client.RedisAPI` を使用します。

source: If you have followed the tracing guide, this class will seem familiar. The main difference is that now, the `hello` message logged with `org.jboss.logging.Logger` will end up in the OpenTelemetry logs.
ja_jp: トレースガイドに従ったことがあれば、このクラスは見慣れたものでしょう。主な違いは、 `org.jboss.logging.Logger` で記録された `hello` メッセージが OpenTelemetry のログに残るようになったことです。

source: If you have generated the application from the previous tutorial, you can find in the `pom.xml` the following Maven profile section:
ja_jp: 前回のチュートリアルでアプリケーションを生成した場合は、 `pom.xml` に以下の Maven プロファイルセクションがあります。

source: If you have generated the application from the previous tutorial, you can find in the `pom.xml` the following _profile_:
ja_jp: 前回のチュートリアルでアプリケーションを生成した場合は、 `pom.xml` に以下の _プロファイル_ があります。

source: If you have https://curl.se/[curl] on your machine, you can try the endpoint using:
ja_jp: マシンに link:https://curl.se/[curl]があれば、エンドポイントを使って試すことができます。

source: If you have https://quarkus.io/guides/building-native-image[GraalVM installed and configured correctly], you can package this application as a native executable:
ja_jp: link:https://quarkus.io/guides/building-native-image[GraalVMが正しくインストールされ、設定されている場合] 、このアプリケーションをネイティブ実行可能ファイルとしてパッケージ化することができます:

source: If you have ideas for new features, or encounter a bug, please let us know by creating a https://github.com/smallrye/smallrye-stork/issues[GitHub issue].
ja_jp: 新機能のアイデアをお持ちの場合やバグに直面した場合は、 link:https://github.com/smallrye/smallrye-stork/issues[GitHubのissue]を作成してお知らせください。

source: If you have missed our Alpha1 announcement: here are link:/blog/quarkus-2-0-0-alpha1-released/[the main new features of Quarkus 2.0].
ja_jp: Alpha1の発表を見逃した方のために、 link:/blog/quarkus-2-0-0-alpha1-released/[Quarkus 2.0の主な新機能]をご紹介します。

source: If you have missed our previous announcements:
ja_jp: これまでのアナウンスを見逃していた方へ:

source: If you have more than one optional dependency to declare in the `quarkus.package.included-optional-dependencies` tag, make sure they are separated with `,` (e.g. `org.postgresql:postgresql::jar,com.foo:bar::jar`).
ja_jp: `quarkus.package.included-optional-dependencies` タグで宣言するオプションの依存関係が複数ある場合は、それらが `,` で区切られていることを確認してください (例: `org.postgresql:postgresql::jar,com.foo: bar::jar`)。
